In [1]:
import pandas as pd
df1 = pd.DataFrame({
    "city":["new york", "chicago", "orlando"],
    "temperature":[21, 31, 35]
})
df1

       city  temperature
0  new york           21
1   chicago           31
2   orlando           35

In [2]:
df2 = pd.DataFrame({
    "city":["chicago", "new york", "orlando", "san francisco"],
    "humidity":[65, 77, 75, 55]
})
df2

            city  humidity
0        chicago        65
1       new york        77
2        orlando        75
3  san francisco        55

In [3]:
# now we are going to marge this two data frames using merge functions
df3 = pd.merge(df1, df2, on="city")
df3
# similar to inner SQL join

       city  temperature  humidity
0  new york           21        77
1   chicago           31        65
2   orlando           35        75

In [6]:
#outer join - it will give all the data 
df3 = pd.merge(df1, df2, on="city", how="outer", indicator = True)
df3

            city  temperature  humidity      _merge
0        chicago         31.0        65        both
1       new york         21.0        77        both
2        orlando         35.0        75        both
3  san francisco          NaN        55  right_only

In [ ]:
# we can also try - left , right

In [7]:
# now we going to see if two table have same title them what merge funtion do

In [8]:
df1 = pd.DataFrame({
    "city":["new york", "chicago", "orlando", "baltimore"],
    "temperature":[21, 14, 35, 38],
    "humidity":[65, 68, 71, 75]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [9]:
df2 = pd.DataFrame({
    "city":["chicago", "new york", "san diego"],
    "temperature":[ 14, 35, 38],
    "humidity":[68, 71, 75]
})
df2

        city  temperature  humidity
0    chicago           14        68
1   new york           35        71
2  san diego           38        75

In [10]:
# here automatically our merge functions give title
df3 = pd.merge(df1, df2, on="city", how = "outer")
df3

        city  temperature_x  humidity_x  temperature_y  humidity_y
0  baltimore           38.0        75.0            NaN         NaN
1    chicago           14.0        68.0           14.0        68.0
2   new york           21.0        65.0           35.0        71.0
3    orlando           35.0        71.0            NaN         NaN
4  san diego            NaN         NaN           38.0        75.0

In [11]:
# we can also change the title
df3 = pd.merge(df1, df2, on="city", how = "outer", suffixes=("_left", "_right"))
df3

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,baltimore,38.0,75.0,NaN,NaN
1,chicago,14.0,68.0,14.0,68.0
2,new york,21.0,65.0,35.0,71.0
3,orlando,35.0,71.0,NaN,NaN
4,san diego,NaN,NaN,38.0,75.0